Repository: TranslateMe/islampro
Catalog: QiblaFinder/*.lproj/Localizable.strings
Languages: ar

source: Aligned with Qibla
ar: محاذاة القبلة

source: Current heading
ar: الاتجاه الحالي

source: Compass ring
ar: حلقة البوصلة

source: Qibla direction indicator
ar: مؤشر اتجاه القبلة

source: Location Access Required
ar: يتطلب الوصول إلى الموقع

# location_permission_explanation
source: QiblaFinder needs your location to determine the accurate Qibla direction. Please enable location access in Settings.
ar: يحتاج تطبيق القبلة إلى موقعك لتحديد اتجاه القبلة الدقيق. يرجى تمكين الوصول إلى الموقع في الإعدادات.

source: Open Settings
ar: فتح الإعدادات

# enable_location_hint
source: Enable location access in Settings to use QiblaFinder
ar: قم بتمكين الوصول إلى الموقع في الإعدادات لاستخدام تطبيق القبلة

source: GPS Signal Weak
ar: إشارة GPS ضعيفة

# using_last_known_location
source: Using last known location from
ar: استخدام آخر موقع معروف من

# no_location_available
source: No location available. Please ensure Location Services are enabled.
ar: لا يوجد موقع متاح. يرجى التأكد من تمكين خدمات الموقع.

source: Retry
ar: إعادة المحاولة

# tap_retry_hint
source: Tap retry to request fresh location
ar: اضغط لإعادة المحاولة وطلب موقع جديد

source: Using cached location from %@
ar: استخدام الموقع المحفوظ من %@

source: just now
ar: الآن

# one_minute_ago
source: 1 minute ago
ar: منذ دقيقة واحدة

# minutes_ago
source: %d minutes ago
ar: منذ %d دقيقة

# today_at_time
source: Today at %@
ar: اليوم في %@

# yesterday_at_time
source: Yesterday at %@
ar: أمس في %@

source: Distance to Mecca
ar: المسافة إلى مكة

source: Qibla Direction
ar: اتجاه القبلة

# distance_and_direction
source: Distance and direction to Mecca
ar: المسافة والاتجاه إلى مكة

source: Location unavailable
ar: الموقع غير متاح

# distance_and_bearing_format
source: Distance: %@, Direction: %@
ar: المسافة: %@، الاتجاه: %@

source: Compass Calibration
ar: معايرة البوصلة

# calibration_instructions
source: Move your iPhone in a figure-8 pattern to calibrate the compass for accurate Qibla direction.
ar: حرك هاتفك بنمط رقم 8 لمعايرة البوصلة من أجل اتجاه قبلة دقيق.

source: Excellent
ar: ممتاز

source: Fair Accuracy
ar: دقة جيدة

source: Calibrate Compass
ar: معايرة البوصلة

source: Unavailable
ar: غير متاح

source: High accuracy, calibrated
ar: دقة عالية، تمت المعايرة

source: Medium accuracy, usable
ar: دقة متوسطة، قابلة للاستخدام

source: Low accuracy, needs calibration
ar: دقة منخفضة، تحتاج إلى معايرة

source: Compass unavailable
ar: البوصلة غير متاحة

# calibration_tap_hint
source: Double tap for calibration instructions
ar: اضغط مرتين للحصول على تعليمات المعايرة

source: OK
ar: موافق

source: Locating...
ar: تحديد الموقع...

source: Calculating prayer times...
ar: حساب أوقات الصلاة...

source: Location permission denied
ar: تم رفض إذن الموقع

# islamic_date_label
source: Islamic date: %@
ar: التاريخ الإسلامي: %@

# prayer_times_list_label
source: Prayer times
ar: أوقات الصلاة

# prayer_name_label
source: %@ prayer
ar: صلاة %@

# prayer_passed
source: Passed
ar: مضت

# next_prayer_hint
source: Next prayer
ar: الصلاة القادمة

# current_prayer_time_hint
source: Current prayer time
ar: وقت الصلاة الحالي

source: Loading location...
ar: تحميل الموقع...

# map_route_to_mecca
source: Map showing route from your location to Mecca
ar: خريطة توضح الطريق من موقعك إلى مكة

source: Mecca
ar: مكة

# map_distance_direction_label
source: Distance: %@, Direction: %@
ar: المسافة: %@، الاتجاه: %@

source: Settings
ar: الإعدادات

source: Prayer Settings
ar: إعدادات الصلاة

source: Calculation Method
ar: طريقة الحساب

# madhab_asr
source: Madhab (Asr Calculation)
ar: المذهب (حساب العصر)

source: Madhab
ar: المذهب

source: Theme
ar: المظهر

source: Premium Features
ar: الميزات المميزة

source: App Theme
ar: مظهر التطبيق

source: Prayer Notifications
ar: إشعارات الصلاة

source: Enable Notifications
ar: تفعيل الإشعارات

# notify_minutes_before
source: Notify %d minutes before
ar: التنبيه قبل %d دقيقة

source: Premium Active
ar: الاشتراك المميز نشط

source: Upgrade to Premium
ar: الترقية إلى النسخة المميزة

# thank_you_premium
source: Thank you for supporting QiblaFinder!
ar: شكراً لدعمك لتطبيق القبلة!

# all_features_unlocked
source: All premium features unlocked
ar: جميع الميزات المميزة مفتوحة

# one_time_purchase
source: One-time purchase • Lifetime access
ar: شراء لمرة واحدة • وصول مدى الحياة

source: Restore Purchases
ar: استعادة المشتريات

source: Processing purchase...
ar: معالجة عملية الشراء...

source: Purchase Error
ar: خطأ في الشراء

# unknown_error
source: An unknown error occurred
ar: حدث خطأ غير معروف

source: About
ar: عن التطبيق

source: QiblaFinder
ar: محدّد القبلة

# version
source: Version 1.0.0
ar: الإصدار 1.0.0

# app_description
source: Accurate Qibla direction and prayer times for Muslims worldwide
ar: اتجاه القبلة الدقيق وأوقات الصلاة للمسلمين في جميع أنحاء العالم

# feature_notifications
source: Prayer notifications
ar: إشعارات الصلاة

# feature_themes
source: Custom themes
ar: مظاهر مخصصة

# feature_methods
source: All calculation methods
ar: جميع طرق الحساب

# feature_watch
source: Apple Watch app
ar: تطبيق Apple Watch

# feature_widgets
source: Home screen widgets
ar: أدوات الشاشة الرئيسية

source: Skip
ar: تخطي

source: Get Started
ar: ابدأ الآن

source: Swipe to continue
ar: اسحب للمتابعة

# onboarding_compass_title
source: Find Qibla Instantly
ar: اعثر على القبلة فوراً

# onboarding_compass_description
source: Real-time compass with visual and haptic feedback shows you the exact direction to face during prayer
ar: بوصلة في الوقت الفعلي مع ملاحظات مرئية وحسية توضح لك الاتجاه الدقيق للقبلة أثناء الصلاة

# onboarding_compass_feature1
source: Accurate Qibla direction
ar: اتجاه القبلة الدقيق

# onboarding_compass_feature2
source: Green alignment indicator
ar: مؤشر محاذاة أخضر

# onboarding_compass_feature3
source: Works worldwide
ar: يعمل في جميع أنحاء العالم

# onboarding_prayer_title
source: Never Miss Prayer
ar: لن تفوتك صلاة أبداً

# onboarding_prayer_description
source: Accurate prayer times calculated for your location using trusted Islamic methods
ar: أوقات صلاة دقيقة محسوبة لموقعك باستخدام أساليب إسلامية موثوقة

# onboarding_prayer_feature1
source: 6 daily prayer times
ar: 6 أوقات صلاة يومية

# onboarding_prayer_feature2
source: Hijri calendar
ar: التقويم الهجري

# onboarding_prayer_feature3
source: Live countdowns
ar: عد تنازلي مباشر

# onboarding_location_title
source: Location Required
ar: الموقع مطلوب

# onboarding_location_description
source: QiblaFinder needs your location to calculate accurate Qibla direction and prayer times for your area
ar: يحتاج تطبيق القبلة إلى موقعك لحساب اتجاه القبلة الدقيق وأوقات الصلاة لمنطقتك

# onboarding_location_feature1
source: Always accurate
ar: دائماً دقيق

# onboarding_location_feature2
source: Works offline
ar: يعمل بدون إنترنت

# onboarding_location_feature3
source: Privacy respected
ar: خصوصيتك محترمة

source: Language
ar: اللغة

# arabic_instructions_title
source: To use Arabic:
ar: للاستخدام بالعربية:

# arabic_instructions
source: Go to iPhone Settings → General → Language & Region → iPhone Language → العربية (Arabic). The app will restart in Arabic.
ar: اذهب إلى إعدادات الآيفون ← عام ← اللغة والمنطقة ← لغة الآيفون ← العربية. سيعيد تشغيل التطبيق باللغة العربية.

# prayer_time_notification_title
source: Prayer Time
ar: وقت الصلاة

# prayer_time_notification_body
source: Time for %@ prayer
ar: وقت صلاة %@

source: Loading
ar: جاري التحميل

source: Error
ar: خطأ

source: Cancel
ar: إلغاء

source: Done
ar: تم

source: Save
ar: حفظ
